app/controllers/hero_powers_controller.rb

INSERT INTO "hero_powers" ("strength", "hero_id", "power_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", "Weak"], ["hero_id", 4], ["power_id", 2], ["created_at", "2023-03-27 12:16:39.913590"], ["updated_at", "2023-03-27 12:16:39.913590"]]
---
  def create
    heropower = HeroPower.create!(hp_params)