app/controllers/powers_controller.rb

  def index
    power = Power.all
---
SELECT "powers".* FROM "powers"

  def show
    power = Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    power = Power.find(params[:id])
    power.update(power_params)
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "powers" SET "description" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["description", "possess anything by staring"], ["updated_at", "2023-03-27 10:13:00.572596"], ["id", 1]]